public class Main {
    public static void main(String[] args) {
        System.out.println("Homework5");
        //Задание 1
        System.out.println (" ");
        System.out.println ("Задание 1");
        int clientOS = 1; // 0 - iOS, 1 - Android
        if (clientOS == 0) {
            System.out.println("Установите версию приложения для iOS по ссылке");
        } else {
            System.out.println("Установите версию приложения для Android по ссылке");
        }
    }


}